Revit 2024 API
ElectricalEquipment.DistributionSystem Property
 get or set the Distribution System for the Electrical Equipment.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public DistributionSysType DistributionSystem { get; set; }
Visual Basic
Public Property DistributionSystem As DistributionSysType
	Get
	Set
Visual C++
public:
property DistributionSysType^ DistributionSystem {
	DistributionSysType^ get ();
	void set (DistributionSysType^ value);
}
Remarks
 This property returns a Distribution System which is assigned to the Electrical Equipment. If there are no Distribution System assigned to this Electrical Equipment, this property will be null.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The Distribution System can not be assigned to the Electrical Equipment.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
ElectricalEquipment Class
Autodesk.Revit.DB.Electrical Namespace